package main

import (
	"fmt"
	"sync"
)

/*Написать программу, которая конкурентно рассчитает значение квадратов
чисел взятых из массива (2,4,6,8,10) и выведет их квадраты в stdout.*/

func main() {
	arr := []int{2, 4, 6, 8, 10}

	wg := new(sync.WaitGroup) // определяем группу горутин
	for _, val := range arr {
		wg.Add(1) // увеличиваем счетчик горутин в группе
		go func(num int) {
			defer wg.Done() // сообщаем, что элемент группы завершил работу
			fmt.Println(num * num)
		}(val)
	}
	wg.Wait() // ожидаем завершения всех горутин в группе

}
